; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-66)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on b8 b18)
    (on b18 b9)
    (on b9 b17)
    (on b17 b10)
    (on b10 b5)
    (on b5 b15)
    (on b15 b11)
    (on b11 b1)
    (on b1 b13)
    (on b13 b2)
    (on b2 b7)
    (on b7 b14)
    (on b14 b20)
    (on-table b20)
    (clear b6)
    (on b6 b3)
    (on b3 b4)
    (on b4 b12)
    (on b12 b19)
    (on b19 b16)
    (on-table b16))
 (:goal (and 
(clear b7) (on b7 b1)
))
)

; plan
1. (unstack b8 b18)
   deleted: (on b8 b18) (clear b8) (arm-empty)
   added: (holding b8) (clear b18)
   goals met: 0 of 2
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 2
3. (unstack b18 b9)
   deleted: (on b18 b9) (clear b18) (arm-empty)
   added: (holding b18) (clear b9)
   goals met: 0 of 2
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 2
5. (unstack b9 b17)
   deleted: (on b9 b17) (clear b9) (arm-empty)
   added: (holding b9) (clear b17)
   goals met: 0 of 2
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 2
7. (unstack b17 b10)
   deleted: (on b17 b10) (clear b17) (arm-empty)
   added: (holding b17) (clear b10)
   goals met: 0 of 2
8. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 2
9. (unstack b10 b5)
   deleted: (on b10 b5) (clear b10) (arm-empty)
   added: (holding b10) (clear b5)
   goals met: 0 of 2
10. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 2
11. (unstack b5 b15)
   deleted: (on b5 b15) (clear b5) (arm-empty)
   added: (holding b5) (clear b15)
   goals met: 0 of 2
12. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 2
13. (unstack b15 b11)
   deleted: (on b15 b11) (clear b15) (arm-empty)
   added: (holding b15) (clear b11)
   goals met: 0 of 2
14. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 2
15. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 0 of 2
16. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 2
17. (unstack b1 b13)
   deleted: (on b1 b13) (clear b1) (arm-empty)
   added: (holding b1) (clear b13)
   goals met: 0 of 2
18. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 2
19. (unstack b13 b2)
   deleted: (on b13 b2) (clear b13) (arm-empty)
   added: (holding b13) (clear b2)
   goals met: 0 of 2
20. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 2
21. (unstack b2 b7)
   deleted: (on b2 b7) (clear b2) (arm-empty)
   added: (holding b2) (clear b7)
   goals met: 1 of 2
22. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 2
23. (unstack b7 b14)
   deleted: (on b7 b14) (clear b7) (arm-empty)
   added: (holding b7) (clear b14)
   goals met: 0 of 2
24. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 2 of 2
